Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_gptm.c
/*********************************************************************************************************//**
 * @brief Configure polarity of the GPTMx channel x.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Channel: Specify the GPTM channel.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CH_0 : GPTM channel 0
 *        @arg GPTM_CH_1 : GPTM channel 1
 *        @arg GPTM_CH_2 : GPTM channel 2
 *        @arg GPTM_CH_3 : GPTM channel 3
 * @param Pol: Specify the polarity of channel x.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CHP_NONINVERTED : active high
 *        @arg GPTM_CHP_INVERTED    : active low
 * @retval None
 ************************************************************************************************************/
void GPTM_ChPolarityConfig(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, GPTM_CHP_Enum Pol)
{
  u32 wChpolr ;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(Channel));
  Assert_Param(IS_GPTM_CHP(Pol));

  /* Set or reset the CHx polarity */
  wChpolr = GPTMx->CHPOLR & (~(u32)(0x1 << (Channel << 1))) ;
  GPTMx->CHPOLR = wChpolr | (Pol << (Channel << 1)) ;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the single pulse immediate active function.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Channel: Specify the GPTM channel.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CH_0 : GPTM channel 0
 *        @arg GPTM_CH_1 : GPTM channel 1
 *        @arg GPTM_CH_2 : GPTM channel 2
 *        @arg GPTM_CH_3 : GPTM channel 3
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 * @note Must configurs output mode to PWM1 or PWM2 before invok this function.
 ************************************************************************************************************/
void GPTM_ImmActiveConfig(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, ControlStatus NewState)
{
  vu32 *pOcfr = (vu32*)&GPTMx->CH0OCFR + Channel ;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(Channel)) ;
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Enable or disable the channel x clear CHxOREF at ETI active function */
  if(NewState != DISABLE)
  {
    *pOcfr |= CHOCFR_IMAE;
  }
  else
  {
    *pOcfr &= ~(u32)CHOCFR_IMAE;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the GPTM channel x.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Channel: Specify the GPTM channel.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CH_0 : GPTM channel 0
 *        @arg GPTM_CH_1 : GPTM channel 1
 *        @arg GPTM_CH_2 : GPTM channel 2
 *        @arg GPTM_CH_3 : GPTM channel 3
 * @param Control: This parameter can be GPTM_CHCTL_ENABLE or GPTM_CHCTL_DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_ChannelConfig(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, GPTM_CHCTL_Enum Control)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(Channel));
  Assert_Param(IS_GPTM_CHCTL(Control));

  /* Reset the CHxE Bit */
  GPTMx->CHCTR &= ~(u32)(0x1 << (Channel << 1));

  /* Set or reset the CHxE Bit */
  GPTMx->CHCTR |=  (u32)Control << (Channel << 1);
}

/*********************************************************************************************************//**
 * @brief Configure ouput mode of the GPTM.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Channel: Specify the GPTM channel.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CH_0 : GPTM channel 0
 *        @arg GPTM_CH_1 : GPTM channel 1
 *        @arg GPTM_CH_2 : GPTM channel 2
 *        @arg GPTM_CH_3 : GPTM channel 3
 * @param Mod: Specify the GPTM output mode.
 *        This paramter can be one of the following values:
 *        @arg GPTM_OM_MATCH_NOCHANGE  : Output dont change on match
 *        @arg GPTM_OM_MATCH_INACTIVE  : Output inactive on compare match
 *        @arg GPTM_OM_MATCH_ACTIVE    : Output active on compare match
 *        @arg GPTM_OM_MATCH_TOGGLE    : Output toggle on compare match
 *        @arg GPTM_OM_FORCED_INACTIVE : Output forced inactive
 *        @arg GPTM_OM_FORCED_ACTIVE   : Output forced active
 *        @arg GPTM_OM_PWM1            : PWM1 mode
 *        @arg GPTM_OM_PWM2            : PWM2 mode
 * @retval None
 * @note This function disables the selected channel before changing the output mode.
 ************************************************************************************************************/
void GPTM_OutputModeConfig(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, GPTM_OM_Enum Mod)
{
  vu32 *pOcfr = (vu32*)&GPTMx->CH0OCFR + Channel ;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(Channel));
  Assert_Param(IS_GPTM_OM(Mod));

  /* Disable the channel: Reset the CHxE Bit */
  GPTMx->CHCTR &= ~(u32)(0x1 << (Channel << 1));

  /* Selects the GPTM ouput mode. */
  *pOcfr = (*pOcfr & CHOCFR_CHOM_MASK) | Mod ;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable update event of the GPTM.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param NewState: This parameter can be ENABLE(default) or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_UpdateCmd(GPTM_TypeDef* GPTMx, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState == DISABLE)
  {
    /* Set the update disable bit */
    GPTMx->CNTCFR |= CNTCFR_UEVDIS;
  }
  else
  {
    /* Reset the update disable bit */
    GPTMx->CNTCFR &= ~(u32)CNTCFR_UEVDIS;
  }
}

