Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_gptm.c
/*********************************************************************************************************//**
 * @brief Set counter register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Counter: Specify the counter register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCounter(GPTM_TypeDef* GPTMx, u16 Counter)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the Counter Register value */
  GPTMx->CNTR = Counter;
}

/*********************************************************************************************************//**
 * @brief Set counter reload register value of the GPTMx .
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Reload: Specify the counter reload register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCounterReload(GPTM_TypeDef* GPTMx, u16 Reload)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the counter reload register value */
  GPTMx->CRR = Reload;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 capture/compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Cmp: Specify the CH0CCR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCaptureCompare0(GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH0CCR register new value */
  GPTMx->CH0CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 1 capture/compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Cmp: Specify the CH1CCR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCaptureCompare1(GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH1CCR register new value */
  GPTMx->CH1CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 capture/compare register value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Cmp: Specify the CH2CCR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCaptureCompare2(GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH2CCR register new value */
  GPTMx->CH2CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 3 capture/compare register value of the GPTMx .
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Cmp: Specify the CH3CCR register new value.
 * @retval None
 ************************************************************************************************************/
void GPTM_SetCaptureCompare3(GPTM_TypeDef* GPTMx, u16 Cmp)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Set the CH3CCR register new value */
  GPTMx->CH3CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Configure input capture prescaler.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Channel: Specify the GPTM channel.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CH_0 : GPTM channel 0
 *        @arg GPTM_CH_1 : GPTM channel 1
 *        @arg GPTM_CH_2 : GPTM channel 2
 *        @arg GPTM_CH_3 : GPTM channel 3
 * @param Psc: Specify the input capture prescaler new value.
 *        This parameter can be one of the following values:
 *        @arg GPTM_CHPSC_OFF : No prescaler
 *        @arg GPTM_CHPSC_2   : Capture is done once every 2 events
 *        @arg GPTM_CHPSC_4   : Capture is done once every 4 events
 *        @arg GPTM_CHPSC_8   : Capture is done once every 8 events
 * @retval None
 ************************************************************************************************************/
void GPTM_CHPSCConfig(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, GPTM_CHPSC_Enum Psc)
{
  vu32 *pIcfr = (vu32*)&GPTMx->CH0ICFR + Channel ;

  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(Channel));
  Assert_Param(IS_GPTM_CHPSC(Psc));

  /* Reset the CHxPSC bits */
  *pIcfr &= CHICFR_CHPSC_MASK;

  /* Set the capture input prescaler value */
  *pIcfr |= Psc;
}

/*********************************************************************************************************//**
 * @brief Set clock division value of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Div: Specify the clock division value.
 *        This parameter can be one of the following value:
 *        @arg GPTM_CKDIV_OFF : fDTS = fCLKIN
 *        @arg GPTM_CKDIV_2   : fDTS = fCLKIN / 2
 *        @arg GPTM_CKDIV_4   : fDTS = fCLKIN / 4
 * @retval None
 ************************************************************************************************************/
void GPTM_CKDIVConfig(GPTM_TypeDef* GPTMx, GPTM_CKDIV_Enum Div)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CKDIV(Div));

