Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_gptm.c
/*********************************************************************************************************//**
 * @brief Disable slave mode to clock the prescaler directly with the internal clock.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @retval None
 ************************************************************************************************************/
void GPTM_InternalClockConfig(GPTM_TypeDef* GPTMx)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));

  /* Disable slave mode to clock the prescaler directly with the internal clock */
  GPTMx->MDCFR &=  MDCFR_SMSEL_MASK;
}



/*********************************************************************************************************//**
 * @brief Configure the CHx as input.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Ch Specify the GPTM Channel.
 *        This parmeter can be one of the following values:
 *        @arg GPTM_CH_0 : GPTM channel 0
 *        @arg GPTM_CH_1 : GPTM channel 1
 *        @arg GPTM_CH_2 : GPTM channel 2
 *        @arg GPTM_CH_3 : GPTM channel 3
 * @param Pol: The input polarity.
 *        This parameter can be one of the following values:
 *        @arg GPTM_CHP_NONINVERTED : Active high level or rising edge
 *        @arg GPTM_CHP_INVERTED    : Active low level or falling edge
 * @param Sel: Specify the input to be used.
 *        This parameter can be one of the following values:
 *        @arg GPTM_CHCCS_DIRECT   : GPTM CHxI is mapped on CHx.
 *        @arg GPTM_CHCCS_INDIRECT : GPTM CH1I is mapped on CH0 (or CH0I->CH1 or CH2I->CH3 or CH3I->CH2).
 *        @arg GPTM_CHCCS_TRCED    : GPTM CHx is mapped on TRC.
 * @param Filter: Specify the input capture filter.
 *        This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 ************************************************************************************************************/
static void
gptm_CHx_Config(GPTM_TypeDef* GPTMx, GPTM_CH_Enum Ch, GPTM_CHP_Enum Pol, GPTM_CHCCS_Enum Sel, u8 Filter)
{
  vu32* pIcfr = (vu32*)&GPTMx->CH0ICFR + Ch ;
  u32 wIcfr, wChpolr;

  /* Disable the channel x: reset the CHxE bit */
  GPTMx->CHCTR &= ~((u32)0x1 << (Ch << 1)) ;

  wIcfr = *pIcfr;
  wChpolr = GPTMx->CHPOLR;

  /* Select the input and set the filter */
  wIcfr &= CHICFR_CHCCS_MASK & CHICFR_CHF_MASK;
  wIcfr |= Sel | Filter;
  *pIcfr = wIcfr;

  /* Select the polarity bit */
  wChpolr &= ~((u32)0x1 << (Ch << 1));
  wChpolr |= (u32)Pol << (Ch << 1);
  GPTMx->CHPOLR = wChpolr;

  /* Set the CHxE Bit */
  GPTMx->CHCTR |= (u32)0x1 << (Ch << 1) ;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified PDMA requests of the GPTM.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param GPTM_PDMA: Specify the GPTM PDMA requests to be enabled or disabled.
 *        This parameter can be any combination of the following values:
 *        @arg GPTM_PDMA_CH0CC     : GPTM Capture/compare 0 PDMA request
 *        @arg GPTM_PDMA_CH1CC     : GPTM Capture/compare 1 PDMA request
 *        @arg GPTM_PDMA_CH2CC     : GPTM Capture/compare 2 PDMA request
 *        @arg GPTM_PDMA_CH3CC     : GPTM Capture/compare 3 PDMA request
 *        @arg GPTM_PDMA_UEV       : GPTM update PDMA request
 *        @arg GPTM_PDMA_TEV       : GPTM trigger PDMA request
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPTM_PDMAConfig(GPTM_TypeDef* GPTMx, u32 GPTM_PDMA, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_PDMA(GPTM_PDMA));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the PDMA request */
    GPTMx->DICTR |= GPTM_PDMA;
  }
  else
  {
    /* Disable the PDMA request */
    GPTMx->DICTR &= ~GPTM_PDMA;
  }
}
/*********************************************************************************************************//**
 * @brief Select Channel Capture/Compare PDMA event of the GPTMx.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral, x can be 0 or 1.
 * @param Selection: This parameter can be GPTM_CHCCDS_CHCCEV or GPTM_CHCCDS_UEV.
 * @retval None
 ************************************************************************************************************/
void GPTM_CHCCDSConfig(GPTM_TypeDef* GPTMx, GPTM_CHCCDS_Enum Selection)
{
  /* Check the parameters */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CHCCDS(Selection));

  if(Selection != GPTM_CHCCDS_CHCCEV)
  {
    GPTMx->CTR |= CTR_CHCCDS;
  }
  else
  {
    GPTMx->CTR &= ~CTR_CHCCDS;
  }
}

/**
  * @}
  *//* End of GPTM_Private_Function group */

/**
  * @}
  *//* End of GPTM group */

/**
  * @}
  *//* End of HT32F175x_275x_Peripheral_Driver group */
